## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 17 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     RESOURCE                                     |
|--------|----------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.superset_docs`                                              |
|        | `aws_acm_certificate_validation.superset_docs`                                   |
|        | `aws_cloudfront_distribution.superset_docs`                                      |
|        | `aws_iam_role_policy_attachment.cds_superset_docs_release[0]`                    |
|        | `aws_lambda_function_url.superset_docs`                                          |
|        | `aws_route53_health_check.superset_docs`                                         |
|        | `aws_route53_record.superset_docs_A`                                             |
|        | `aws_route53_record.superset_docs_cert_validation[&quot;*.docs.superset.cds-snc.ca&quot;]` |
|        | `aws_route53_record.superset_docs_cert_validation[&quot;docs.superset.cds-snc.ca&quot;]`   |
|        | `module.github_workflow_roles[0].aws_iam_role.this[&quot;cds-superset-docs-release&quot;]` |
|        | `module.superset_docs.aws_cloudwatch_log_group.this`                             |
|        | `module.superset_docs.aws_cloudwatch_query_definition.lambda_statistics`         |
|        | `module.superset_docs.aws_iam_policy.non_vpc_policies[0]`                        |
|        | `module.superset_docs.aws_iam_role.this`                                         |
|        | `module.superset_docs.aws_iam_role_policy_attachment.lambda_insights[0]`         |
|        | `module.superset_docs.aws_iam_role_policy_attachment.non_vpc_policies[0]`        |
|        | `module.superset_docs.aws_lambda_function.this`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.superset_docs will be created
  + resource "aws_acm_certificate" "superset_docs" {
      + arn                       = (known after apply)
      + domain_name               = "docs.superset.cds-snc.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.docs.superset.cds-snc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "docs.superset.cds-snc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.docs.superset.cds-snc.ca",
          + "docs.superset.cds-snc.ca",
        ]
      + tags                      = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.superset_docs will be created
  + resource "aws_acm_certificate_validation" "superset_docs" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.superset_docs will be created
  + resource "aws_cloudfront_distribution" "superset_docs" {
      + aliases                         = [
          + "docs.superset.cds-snc.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 1
          + target_origin_id       = "cds-superset-docs"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "cds-superset-docs"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_iam_role_policy_attachment.cds_superset_docs_release[0] will be created
  + resource "aws_iam_role_policy_attachment" "cds_superset_docs_release" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "cds-superset-docs-release"
    }

  # aws_lambda_function_url.superset_docs will be created
  + resource "aws_lambda_function_url" "superset_docs" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "cds-superset-docs"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # aws_route53_health_check.superset_docs will be created
  + resource "aws_route53_health_check" "superset_docs" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 5
      + fqdn              = (known after apply)
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + regions           = [
          + "us-east-1",
          + "us-west-1",
          + "us-west-2",
        ]
      + request_interval  = 30
      + resource_path     = "/"
      + tags              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + triggers          = (known after apply)
      + type              = "HTTPS"
    }

  # aws_route53_record.superset_docs_A will be created
  + resource "aws_route53_record" "superset_docs_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "docs.superset.cds-snc.ca"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.superset_docs_cert_validation["*.docs.superset.cds-snc.ca"] will be created
  + resource "aws_route53_record" "superset_docs_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (sensitive value)
    }

  # aws_route53_record.superset_docs_cert_validation["docs.superset.cds-snc.ca"] will be created
  + resource "aws_route53_record" "superset_docs_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (sensitive value)
    }

  # module.github_workflow_roles[0].aws_iam_role.this["cds-superset-docs-release"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/cds-superset-docs:ref:refs/tags/v*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::066023111852:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cds-superset-docs-release"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.superset_docs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/cds-superset-docs"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
    }

  # module.superset_docs.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/cds-superset-docs",
        ]
      + name                = "Lambda Statistics / cds-superset-docs"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.superset_docs.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cds-superset-docs_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:066023111852:repository/cds-superset-docs"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
    }

  # module.superset_docs.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cds-superset-docs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.superset_docs.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "cds-superset-docs"
    }

  # module.superset_docs.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cds-superset-docs"
    }

  # module.superset_docs.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "cds-superset-docs"
      + id                             = (known after apply)
      + image_uri                      = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/cds-superset-docs:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 4096
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-superset-docs-prod"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "MENU_ID_EN"         = "9"
              + "MENU_ID_FR"         = "10"
              + "SITE_NAME_EN"       = "Superset Docs"
              + "SITE_NAME_FR"       = "Docs de Superset"
              + "WORDPRESS_PASSWORD" = (sensitive value)
              + "WORDPRESS_URL"      = "https://articles.alpha.canada.ca/pcs-superset"
              + "WORDPRESS_USER"     = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
